package information

func M1() map[string][]string {
	m1 := map[string][]string{
		//姓名 职位(A：行政，D：教研室主任，T：教师) 课时 入职时间 是否住宿 是否党员
		"1谢希仁":  []string{"谢希仁", "A", "0", "2017-08-30", "Y", "N"},
		"2吴功宜":  []string{"吴功宜", "A", "0", "2018-04-12", "N", "Y"},
		"3陈鸣":   []string{"陈鸣", "A", "0", "2017-03-26", "Y", "N"},
		"4吴英":   []string{"吴英", "D", "40", "2019-08-22", "Y", "N"},
		"5徐恪":   []string{"徐恪", "T", "38", "2020-06-15", "N", "N"},
		"6徐明伟":  []string{"徐明伟", "T", "44", "2018-06-07", "Y", "N"},
		"7陈威兵":  []string{"陈威兵", "T", "48", "2016-10-06", "Y", "N"},
		"8张传福":  []string{"张传福", "T", "32", "2019-12-26", "N", "Y"},
		"9张刚林":  []string{"张刚林", "T", "46", "2021-03-22", "N", "Y"},
		"10赵立英": []string{"赵立英", "T", "40", "2019-05-15", "N", "Y"},
	}
	return m1
}
